<?php

use App\About;
use Illuminate\Database\Seeder;

class AboutSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        About::create([
            'name' => 'تعريف',
            'title' => 'تعرف علينا',
            'desc' => 'دوائر التقنيه هي شركه رائده في مجال تصميم وتطوير المواقع الالكترونيه والتطبيقات
                                    علي الاندرويد و الايفون
                                    تقدم لك الشركه حلول تساعد الشركات و المؤسسات علي رفع معدلات الدخل و النمو وتطوير
                                    حركه الانتاج من خلال التجاره الالكترونيه علي الاندرويد والايفون و الويندوز
                                    وتوظيف الذكاء الاصطناعي لتحليل البيانات
                                    شركه دوائر التقنيه تقدم لك الاستشارات الفنيه و البرمجيه لرواد الاعمال كما
                                    تساعدهم علي التطور السريع من خلال احدث طرق الذكاء الاصطناعي وتحليل البيانات',
        ]);
        About::create([
            'name' => 'الرؤيه',
            'title' =>'رؤيتنا',
            'desc' => 'لريادة في إبداع و تطوير أفكار برمجية خلاقة على مستوى المنطقة العربية و العالم
                                    اجمع , نسعى لتقديم خدمات برمجية تقنية محترفة عالية الجودة و باسعار منافسة ,
                                    تتجاوز توقعات العملاء , و قد حرصت دوائر التقنيه منذ تأسيسها على تحقيق اعلى مستوى
                                    جودة',
        ]);
        About::create([
            'name' => 'الرساله',
            'title' => 'الرساله',
            'desc' => 'تكوين كيان يدفع باتجاه تطور صناعة البرمجيات في المنطقة وفق أحدث الطرق العلمية , و
                                    ترسيخ فكر الإبداع في هذه الصناعة اعتمادا على كوادر ذات خبرة سنوات طويلة بالسوق
                                    البرمجية , بالإضافة لتقديم حلول متكاملة لعملائها في مجالات تطبيقات الويب و
                                    تطبيقات الهواتف الذكية بكافة أنظمتها و إنجاز متطلباتهم بدقة و كفاءة عالية',
        ]);
        About::create([
            'name' => 'الاستراتجيه',
            'title' => 'الاستراتجيه',
            'desc' => ' تقديم اعلي كفاءه فى العمل لنيل رضا العملاء المميزين ورفع من العلامه التجاريه
                                    لشركه دوائر التقنيه و قد حرصت دوائر التقنيه منذ تأسيسها على تحقيق اعلى مستوى
                                    جودة التي تميزنا عن غيرنا من الشركات',
        ]);

    }
}
